mrquincle/nRF5-SDK-for-Mesh/mesh/bearer/src/scanner.c
/* Copyright (c) 2010 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "scanner.h"
#include "timer_scheduler.h"
#include "packet_buffer.h"
#include "toolchain.h"
#include "timeslot.h"
#include "filter_engine.h"
#include "debug_pins.h"
#include "mesh_pa_lna_internal.h"
#include "nrf_mesh_config_bearer.h"
#include "bearer_handler.h"
#include "advertiser.h"

#ifdef NRF52_SERIES
#define LNA_SETUP_OVERHEAD_US 1
#elif defined(NRF51)
#define LNA_SETUP_OVERHEAD_US 6
#endif

#define TIFS 150 /**< Bluetooth specification TIFS value in microseconds. */
#define RADIO_RXTX_CHAIN_DELAY_1M_US 9 /**< Chain delay in microseconds when switching from rx to tx on 1Mbps */
#define SCANNER_TIMER_INDEX_TIMESTAMP   (TS_TIMER_INDEX_RADIO)
#define SCANNER_TIMER_INDEX_LNA_SETUP   (1)
#define SCANNER_PPI_CH                  (TS_TIMER_PPI_CH_START + TS_TIMER_INDEX_RADIO)
#define SCANNER_TIMER_LNA_INTERRUPT_Msk (1UL << (TIMER_INTENSET_COMPARE0_Pos + SCANNER_TIMER_INDEX_LNA_SETUP))

/** Scanner packet overhead (i.e. size of packet if length is 0). */
#define SCANNER_PACKET_OVERHEAD (offsetof(scanner_packet_t, packet.addr))

/** Scanner configuration, used to change radio parameters used by the scanner. */
typedef struct
{
    radio_config_t radio_config;                                 /**< Radio configuration. */
    uint32_t       scan_window_us;                               /**< Length of a single scan window in microseconds. Must not be greater than @c scan_interval. */
    uint32_t       scan_interval_us;                             /**< Time between the start of each scan window. */
    uint8_t        channels[SCANNER_CHANNELS_MAX];               /**< Radio channels to be used by the scanner. */
    uint8_t        channel_count;                                /**< Number of radio channels. */
    uint32_t       access_addresses[RADIO_CONFIG_LOGICAL_ADDRS]; /**< Access addresses to be used by the scanner. */
} scanner_config_t;

typedef enum
{
    SCANNER_STATE_UNINITIALIZED,
    SCANNER_STATE_IDLE,
    SCANNER_STATE_RUNNING,
    SCANNER_STATE_SCAN_REQ,
} scanner_state_t;

typedef enum
{
    SCAN_WINDOW_STATE_OFF,
    SCAN_WINDOW_STATE_ON,
    SCAN_WINDOW_STATE_NEXT_CHANNEL
} scan_window_state_t;

typedef struct
{
    scanner_state_t          state;
    bool                     has_radio_context;
    bool                     waiting_for_memory;
    bool                     is_radio_cfg_pending;
    scan_window_state_t      window_state;
    uint8_t                  channel_index;         /**< Index in the channel map */
    packet_buffer_packet_t * p_buffer_packet;
    scanner_stats_t          stats;
    scanner_config_t         config;
    timer_event_t            timer_window_start;
    timer_event_t            timer_window_end;
    bearer_event_flag_t      nrf_mesh_process_flag;
    packet_buffer_t          packet_buffer;
    uint8_t                  packet_buffer_data[SCANNER_BUFFER_SIZE];
    scanner_rx_callback_t    rx_callback;
    ts_timestamp_t           prev_packet_end;
} scanner_t;


/**
 * BLE standard scan request packet.
 */
typedef struct __attribute((packed))
{
    ble_packet_hdr_t header;             /**< BLE packet header */
    uint8_t scan_addr[BLE_GAP_ADDR_LEN]; /**< Scanner's BLE GAP advertisement address */
    uint8_t adv_addr[BLE_GAP_ADDR_LEN];  /**< Advertiser's BLE GAP advertisement address */
} scan_req_packet_t;
/*****************************************************************************
* Static variables
*****************************************************************************/

static scanner_t m_scanner;
#if SCANNER_ACTIVE_SCANNING
static scan_req_packet_t m_scan_req_packet;
#endif
/*****************************************************************************
* Static functions
*****************************************************************************/

static inline void channel_iterate(void)
{
    if (++m_scanner.channel_index >= m_scanner.config.channel_count)
    {
        m_scanner.channel_index = 0;
    }
    m_scanner.window_state = SCAN_WINDOW_STATE_NEXT_CHANNEL;
}

static inline bool continuous_scanning(void)
{
    return (m_scanner.config.scan_interval_us == m_scanner.config.scan_window_us);
}

/*****************************************************************************
* Radio operation
*****************************************************************************/

