mrquincle/nRF5-SDK-for-Mesh/mesh/bearer/src/scanner.c
static bool radio_set_packet(void)
{
    NRF_MESH_ASSERT(m_scanner.p_buffer_packet == NULL);

    bool got_packet = (NRF_SUCCESS == packet_buffer_reserve(&m_scanner.packet_buffer,
                                                            &m_scanner.p_buffer_packet,
                                                            sizeof(scanner_packet_t)));
    if (got_packet)
    {
        scanner_packet_t * p_packet = (scanner_packet_t *) m_scanner.p_buffer_packet->packet;
        NRF_RADIO->PACKETPTR = (uint32_t) &p_packet->packet;
    }
    else
    {
        m_scanner.stats.out_of_memory++;
    }

    m_scanner.waiting_for_memory = !got_packet;
    return got_packet;
}

static void radio_configure(void)
{
    radio_config_reset();
    radio_config_config(&m_scanner.config.radio_config);

    NRF_RADIO->RXADDRESSES = 0;
    for (uint32_t i = 0; i < RADIO_CONFIG_LOGICAL_ADDRS; i++)
    {
        if (m_scanner.config.access_addresses[i] != SCANNER_ACCESS_ADDR_INVALID)
        {
            radio_config_access_addr_set(m_scanner.config.access_addresses[i], i);
            NRF_RADIO->RXADDRESSES |= (1UL << i);
        }
    }

    NRF_RADIO->INTENSET = RADIO_INTENSET_END_Msk;
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_ADDRESS_RSSISTART_Msk;
    NRF_RADIO->EVENTS_ADDRESS = 0;

    /* Set up timestamp capture */
    NRF_PPI->CH[SCANNER_PPI_CH].EEP = (uint32_t) &NRF_RADIO->EVENTS_ADDRESS;
    NRF_PPI->CH[SCANNER_PPI_CH].TEP = (uint32_t) &NRF_TIMER0->TASKS_CAPTURE[SCANNER_TIMER_INDEX_TIMESTAMP];
    NRF_PPI->CHENSET = (1UL << SCANNER_PPI_CH);
}

/**
 * Switch to higher priority interrupt context by triggering radio interrupt.
 */
static inline void radio_trigger(void)
{
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);
    if (m_scanner.has_radio_context)
    {
        (void) NVIC_SetPendingIRQ(RADIO_IRQn);
    }
    _ENABLE_IRQS(was_masked);
}

static void radio_stop(void)
{
    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_RADIO_IN_RX);
    NRF_RADIO->TASKS_DISABLE = 1;
    if (m_scanner.p_buffer_packet != NULL)
    {
        packet_buffer_free(&m_scanner.packet_buffer, m_scanner.p_buffer_packet);
        m_scanner.p_buffer_packet = NULL;
    }
#if !defined(HOST)
    while (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled);
#endif
    mesh_pa_lna_cleanup();
}

#if SCANNER_ACTIVE_SCANNING
static void radio_scan_req(void)
{
    NRF_RADIO->SHORTS = RADIO_SHORTS_END_DISABLE_Msk;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_DISABLE = 1;
    NRF_RADIO->PACKETPTR = (uint32_t) &m_scan_req_packet;
    NRF_RADIO->TXADDRESS = NRF_RADIO->RXMATCH;
    while (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled);
    NRF_RADIO->TASKS_TXEN = 1;

    /* Set up timer to start radio transmission */
    NRF_PPI->CHENCLR = (1UL << SCANNER_PPI_CH);
    NRF_TIMER0->INTENCLR = (1 << SCANNER_TIMER_INDEX_TIMESTAMP);
    NRF_TIMER0->CC[SCANNER_TIMER_INDEX_TIMESTAMP] = m_scanner.prev_packet_end + TIFS - RADIO_RXTX_CHAIN_DELAY_1M_US;
    NRF_PPI->CH[SCANNER_PPI_CH].EEP = (uint32_t) &NRF_TIMER0->EVENTS_COMPARE[SCANNER_TIMER_INDEX_TIMESTAMP];
    NRF_PPI->CH[SCANNER_PPI_CH].TEP = (uint32_t) &NRF_RADIO->TASKS_START;
    NRF_PPI->CHENSET = (1UL << SCANNER_PPI_CH);
}
#endif

static void radio_start(void)
{
    NRF_MESH_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled);

    radio_config_channel_set(m_scanner.config.channels[m_scanner.channel_index]);
    if (m_scanner.is_radio_cfg_pending)
    {
        radio_configure();
        m_scanner.is_radio_cfg_pending = false;
    }
    if (radio_set_packet())
    {
        BEARER_ACTION_TIMER->TASKS_CAPTURE[SCANNER_TIMER_INDEX_LNA_SETUP] = 1;
        NRF_RADIO->TASKS_RXEN = 1;

        mesh_lna_setup_start(BEARER_ACTION_TIMER->CC[SCANNER_TIMER_INDEX_LNA_SETUP] + LNA_SETUP_OVERHEAD_US,
                             SCANNER_TIMER_INDEX_LNA_SETUP);
        mesh_pa_lna_setup_stop();

        BEARER_ACTION_TIMER->EVENTS_COMPARE[SCANNER_TIMER_INDEX_LNA_SETUP] = 0;
        NVIC_ClearPendingIRQ(BEARER_ACTION_TIMER_IRQn);
        BEARER_ACTION_TIMER->INTENSET = SCANNER_TIMER_LNA_INTERRUPT_Msk;

        DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_RADIO_IN_RX);
    }
    m_scanner.window_state = SCAN_WINDOW_STATE_ON;
}
    
//static int incoming = 0;

static void radio_handle_rx_end_event(void)
{
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_END_EVENT);

//  incoming++;
//    __LOG(LOG_SRC_NETWORK, LOG_LEVEL_DBG3, "Rx event %x\n", incoming);

    bool successful_receive = false;
    scanner_packet_t * p_packet = (scanner_packet_t *) m_scanner.p_buffer_packet->packet;

    if (!NRF_RADIO->CRCSTATUS)
    {
        m_scanner.stats.crc_failures++;
    }
    else if (p_packet->packet.header.length > m_scanner.config.radio_config.payload_maxlen)
    {
        m_scanner.stats.length_out_of_bounds++;
    }
    else
    {
        successful_receive = true;
    }

    if (successful_receive)
    {
        p_packet->metadata.rssi = - ((int32_t) NRF_RADIO->RSSISAMPLE);
        p_packet->metadata.access_addr = m_scanner.config.access_addresses[NRF_RADIO->RXMATCH];
        /* The 6 lowest bit of the datawhite IV is the same as the channel number in BLE: */
        p_packet->metadata.channel = NRF_RADIO->DATAWHITEIV & 0x3F;
        ts_timestamp_t rx_timestamp_ts = NRF_TIMER0->CC[SCANNER_TIMER_INDEX_TIMESTAMP];
        p_packet->metadata.timestamp = ts_timer_to_device_time(rx_timestamp_ts);

        memcpy(p_packet->metadata.adv_addr.addr, p_packet->packet.addr, BLE_GAP_ADDR_LEN);
        p_packet->metadata.adv_addr.addr_type = p_packet->packet.header.addr_type;
        p_packet->metadata.adv_type = p_packet->packet.header.type;

        m_scanner.stats.successful_receives++;

        if (m_scanner.rx_callback != NULL)
        {
            m_scanner.rx_callback(p_packet, rx_timestamp_ts);
        }

#if SCANNER_ACTIVE_SCANNING
        if ((p_packet->packet.header.type == BLE_PACKET_TYPE_ADV_IND ||
             p_packet->packet.header.type == BLE_PACKET_TYPE_ADV_DISCOVER_IND) &&
             p_packet->packet.header.length >= BLE_GAP_ADDR_LEN)
        {
            m_scanner.prev_packet_end =
                rx_timestamp_ts + (p_packet->packet.header.length + BLE_ADV_PACKET_HEADER_LENGTH + RADIO_CONFIG_CRC_LEN) *
                                      RADIO_TIME_PER_BYTE(RADIO_MODE_BLE_1MBIT);

