mrquincle/nRF5-SDK-for-Mesh/mesh/bearer/src/scanner.c
            memcpy(m_scan_req_packet.adv_addr, p_packet->packet.addr, BLE_GAP_ADDR_LEN);
            m_scan_req_packet.header._rfu2 = p_packet->packet.header.addr_type;

            m_scanner.state = SCANNER_STATE_SCAN_REQ;
        }
#endif

        packet_buffer_commit(&m_scanner.packet_buffer,
                             m_scanner.p_buffer_packet,
                             SCANNER_PACKET_OVERHEAD + p_packet->packet.header.length);

        bearer_event_flag_set(m_scanner.nrf_mesh_process_flag);
    }
    else
    {
        packet_buffer_free(&m_scanner.packet_buffer, m_scanner.p_buffer_packet);
    }

    m_scanner.p_buffer_packet = NULL;
    
    //incoming--;

    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_END_EVENT);
}

static void radio_state_disabled_handle(void)
{
    switch (m_scanner.window_state)
    {
        case SCAN_WINDOW_STATE_NEXT_CHANNEL:
        case SCAN_WINDOW_STATE_ON:
            radio_start();
            break;
        case SCAN_WINDOW_STATE_OFF:
            // Do nothing
            break;
        default:
            NRF_MESH_ASSERT(false);
    }
}

static void radio_state_rxidle_handle(void)
{
    switch (m_scanner.window_state)
    {
        case SCAN_WINDOW_STATE_NEXT_CHANNEL:
            /* Go to disabled state to change channels */
            radio_stop();
            radio_start();
            break;
        case SCAN_WINDOW_STATE_ON:
            if (radio_set_packet())
            {
                NRF_RADIO->TASKS_START = 1;
                DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_RADIO_IN_RX);
            }
            break;
        case SCAN_WINDOW_STATE_OFF:
            radio_stop();
            break;
        default:
            NRF_MESH_ASSERT(false);
    }
}

static void radio_state_rx_handle(void)
{
    switch (m_scanner.window_state)
    {
        case SCAN_WINDOW_STATE_NEXT_CHANNEL:
            /* Go to disabled state to change channels */
            radio_stop();
            radio_start();
            break;
        case SCAN_WINDOW_STATE_ON:
            // Do nothing
            break;
        case SCAN_WINDOW_STATE_OFF:
            radio_stop();
            break;
        default:
            NRF_MESH_ASSERT(false);
    }
}

static void radio_setup_next_operation(void)
{
    switch (m_scanner.state)
    {
        case SCANNER_STATE_IDLE:
            radio_stop();
            break;

        case SCANNER_STATE_RUNNING:
            switch (NRF_RADIO->STATE)
            {
                case RADIO_STATE_STATE_Disabled:
                    radio_state_disabled_handle();
                    break;
                case RADIO_STATE_STATE_RxIdle:
                    radio_state_rxidle_handle();
                    break;
                case RADIO_STATE_STATE_Rx:
                case RADIO_STATE_STATE_RxRu:
                    radio_state_rx_handle();
                    break;
                case RADIO_STATE_STATE_RxDisable:
                default:
                    NRF_MESH_ASSERT(false);
            }
            break;
#if SCANNER_ACTIVE_SCANNING
        case SCANNER_STATE_SCAN_REQ:
            /* Scan requests should only be initiated from the RX idle state, right after a successful receive. */
            if (NRF_RADIO->STATE == RADIO_STATE_STATE_RxIdle)
            {
                radio_scan_req();
            }
            break;
#endif
        case SCANNER_STATE_UNINITIALIZED:
        default:
            NRF_MESH_ASSERT(false);
    }
}

/*****************************************************************************
* Bearer handler callback functions
*****************************************************************************/

void scanner_radio_start(ts_timestamp_t start_time)
{
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_START);
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_IN_ACTION);

    NRF_MESH_ASSERT(m_scanner.state != SCANNER_STATE_SCAN_REQ);
    m_scanner.has_radio_context = true;
    m_scanner.is_radio_cfg_pending = false;
    radio_configure();

    if (scanner_is_enabled() && m_scanner.window_state != SCAN_WINDOW_STATE_OFF)
    {
        radio_start();
    }
    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_START);
}

void scanner_radio_stop(void)
{
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_STOP);
    m_scanner.has_radio_context = false;
    // Abandon any pending scan requests
    if (m_scanner.state == SCANNER_STATE_SCAN_REQ)
    {
        m_scanner.state = SCANNER_STATE_RUNNING;
    }
    radio_stop();
    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_IN_ACTION);
    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_STOP);
}

void scanner_radio_irq_handler(void)
{
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_RADIO_IRQ);
    if (NRF_RADIO->EVENTS_END)
    {
        DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_RADIO_IN_RX);
        NRF_RADIO->EVENTS_END = 0;
        (void) NRF_RADIO->EVENTS_END;

        if (m_scanner.state == SCANNER_STATE_SCAN_REQ)
        {
            m_scanner.state = SCANNER_STATE_RUNNING;
            while (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled);
            radio_configure();
        }
        else
        {
            radio_handle_rx_end_event();
        }
    }

    radio_setup_next_operation();

    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_RADIO_IRQ);
}

void scanner_timer_irq_handler(void)
{
    /* As soon as the LNA timer fires, we prepare for the stop to avoid getting hit by rollover. */
    NRF_MESH_ASSERT(BEARER_ACTION_TIMER->EVENTS_COMPARE[SCANNER_TIMER_INDEX_LNA_SETUP]);
    BEARER_ACTION_TIMER->INTENCLR = SCANNER_TIMER_LNA_INTERRUPT_Msk;
    BEARER_ACTION_TIMER->EVENTS_COMPARE[SCANNER_TIMER_INDEX_LNA_SETUP] = 0;
    (void) BEARER_ACTION_TIMER->EVENTS_COMPARE[SCANNER_TIMER_INDEX_LNA_SETUP];

    mesh_pa_lna_disable_start();
}
/*****************************************************************************
* Timer handling
*****************************************************************************/

static void scan_window_end(uint32_t timestamp, void * p_context)
{
    m_scanner.window_state = SCAN_WINDOW_STATE_OFF;
    radio_trigger();
}

