mrquincle/nRF5-SDK-for-Mesh/mesh/bearer/src/scanner.c
static void scan_window_start(uint32_t timestamp, void * p_context)
{
    channel_iterate();
    radio_trigger();
}

static void schedule_timers(void)
{
    uint32_t time_now = timer_now();

    if (continuous_scanning())
    {
        timer_sch_abort(&m_scanner.timer_window_end);
    }
    else
    {
        timer_sch_reschedule(&m_scanner.timer_window_end, time_now + m_scanner.config.scan_window_us);
    }

    timer_sch_reschedule(&m_scanner.timer_window_start, time_now);
}

/*****************************************************************************
* Interface functions
*****************************************************************************/

void scanner_init(bearer_event_flag_callback_t packet_process_cb)
{
    memset(&m_scanner, 0, sizeof(m_scanner));

    packet_buffer_init(&m_scanner.packet_buffer, m_scanner.packet_buffer_data, SCANNER_BUFFER_SIZE);
    scanner_config_reset();
    m_scanner.config.radio_config.tx_power = RADIO_POWER_NRF_0DBM;
    m_scanner.config.radio_config.payload_maxlen = RADIO_CONFIG_ADV_MAX_PAYLOAD_SIZE;
    m_scanner.timer_window_end.cb = scan_window_end;
    m_scanner.timer_window_start.cb = scan_window_start;
    m_scanner.state = SCANNER_STATE_IDLE;
    m_scanner.window_state = SCAN_WINDOW_STATE_ON;
    m_scanner.nrf_mesh_process_flag = bearer_event_flag_add(packet_process_cb);

#if SCANNER_ACTIVE_SCANNING
    m_scan_req_packet.header.length = 2 * BLE_GAP_ADDR_LEN;
    m_scan_req_packet.header.type = BLE_PACKET_TYPE_SCAN_REQ;
    ble_gap_addr_t addr;
    advertiser_address_default_get(&addr);
    m_scan_req_packet.header.addr_type = (addr.addr_type == BLE_GAP_ADDR_TYPE_RANDOM_STATIC);
    memcpy(m_scan_req_packet.scan_addr, addr.addr, BLE_GAP_ADDR_LEN);
#endif
}

void scanner_rx_callback_set(scanner_rx_callback_t callback)
{
    if (m_scanner.rx_callback)
    {
        /* Make sure we don't overwrite an active callback */
        NRF_MESH_ASSERT(callback == NULL);
    }
    m_scanner.rx_callback = callback;
}

void scanner_enable(void)
{
    NRF_MESH_ASSERT(m_scanner.state != SCANNER_STATE_UNINITIALIZED);

    if (m_scanner.state == SCANNER_STATE_IDLE)
    {
        schedule_timers();
        m_scanner.state = SCANNER_STATE_RUNNING;
        bearer_handler_wake_up();
    }
}

void scanner_disable(void)
{
    NRF_MESH_ASSERT(m_scanner.state != SCANNER_STATE_UNINITIALIZED);

    if (scanner_is_enabled())
    {
        timer_sch_abort(&m_scanner.timer_window_end);
        timer_sch_abort(&m_scanner.timer_window_start);
        m_scanner.state = SCANNER_STATE_IDLE;
        radio_trigger();
    }
}

bool scanner_is_enabled(void)
{
    return (m_scanner.state == SCANNER_STATE_RUNNING || m_scanner.state == SCANNER_STATE_SCAN_REQ);
}

const scanner_packet_t * scanner_rx(void)
{
    packet_buffer_packet_t * p_packet;

    while (packet_buffer_pop(&m_scanner.packet_buffer, &p_packet) == NRF_SUCCESS)
    {
        if (fen_filters_apply((scanner_packet_t *)p_packet->packet))
        {
            scanner_packet_release((scanner_packet_t *)p_packet->packet);
        }
        else
        {
            return (scanner_packet_t *)p_packet->packet;
        }
    }

    return NULL;
}

void scanner_packet_release(const scanner_packet_t * p_packet)
{
    NRF_MESH_ASSERT(p_packet != NULL);
    packet_buffer_free(&m_scanner.packet_buffer,
                       PARENT_BY_FIELD_GET(packet_buffer_packet_t, packet, p_packet));
    if (m_scanner.waiting_for_memory)
    {
        radio_trigger();
    }
}

const scanner_stats_t * scanner_stats_get(void)
{
    return &m_scanner.stats;
}

bool scanner_rx_pending(void)
{
    return packet_buffer_can_pop(&m_scanner.packet_buffer);
}

/*****************************************************************************
* Configuration interface functions
*****************************************************************************/

void scanner_config_radio_mode_set(radio_mode_t radio_mode)
{
    m_scanner.config.radio_config.radio_mode = radio_mode;
    m_scanner.is_radio_cfg_pending = true;
}

void scanner_config_scan_time_set(uint32_t scan_interval_us, uint32_t scan_window_us)
{
    NRF_MESH_ASSERT(scan_interval_us >= scan_window_us);
    NRF_MESH_ASSERT(scan_interval_us <= MS_TO_US(BEARER_SCAN_INT_MAX_MS));
    NRF_MESH_ASSERT(scan_window_us >= MS_TO_US(BEARER_SCAN_WIN_MIN_MS));
    m_scanner.config.scan_interval_us = scan_interval_us;
    m_scanner.config.scan_window_us = scan_window_us;
    m_scanner.timer_window_end.interval = m_scanner.config.scan_interval_us;
    m_scanner.timer_window_start.interval = m_scanner.config.scan_interval_us;
    if (scanner_is_enabled())
    {
        schedule_timers();
    }
}

static bool channels_are_valid(const uint8_t * p_channels, uint8_t channel_count)
{
    uint8_t valid_channels[] = SCANNER_CHANNELS_DEFAULT;

    for (uint8_t i = 0; i < channel_count; i++)
    {
        bool found = false;
        for (uint8_t j = 0; j < sizeof(valid_channels); j++)
        {
            if (p_channels[i] == valid_channels[j])
            {
                found = true;
                break;
            }
        }
        if (!found)
        {
            return false;
        }
    }
    return true;
}

void scanner_config_channels_set(const uint8_t * p_channels, uint8_t channel_count)
{
    NRF_MESH_ASSERT(channel_count > 0 && channel_count <= SCANNER_CHANNELS_MAX);
    NRF_MESH_ASSERT(channels_are_valid(p_channels, channel_count));
    memcpy(m_scanner.config.channels, p_channels, channel_count);
    m_scanner.channel_index = 0;
    m_scanner.config.channel_count = channel_count;
}

/* The memset() in scanner_config_access_addresses_set() will not have the expected effect
   unless SCANNER_ACCESS_ADDR_INVALID is zero. */
NRF_MESH_STATIC_ASSERT(SCANNER_ACCESS_ADDR_INVALID == 0);

void scanner_config_access_addresses_set(const uint32_t * p_access_addresses, uint8_t address_count)
{
    NRF_MESH_ASSERT(address_count > 0 && address_count <= RADIO_CONFIG_LOGICAL_ADDRS);
    memset(&m_scanner.config.access_addresses[0], 0, sizeof(m_scanner.config.access_addresses));
    memcpy(&m_scanner.config.access_addresses[0], p_access_addresses, sizeof(uint32_t) * address_count);

    m_scanner.is_radio_cfg_pending = true;
}

void scanner_config_reset(void)
{
    uint8_t channels[] = SCANNER_CHANNELS_DEFAULT;
    scanner_config_channels_set(channels, sizeof(channels));

    uint32_t access_address = BEARER_ACCESS_ADDR_DEFAULT;
    scanner_config_access_addresses_set(&access_address, 1);

    scanner_config_radio_mode_set(RADIO_MODE_BLE_1MBIT);
    scanner_config_scan_time_set(MS_TO_US(BEARER_SCAN_INT_DEFAULT_MS), MS_TO_US(BEARER_SCAN_WINDOW_DEFAULT_MS));
}
